cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401R.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>TIMER32</name>
        <version>356.0</version>
        <description>TIMER32</description>
        <baseAddress>0x4000C000</baseAddress>
        <interrupt>
            <name>T32_INT1_IRQ</name>
            <description>T32_INT1 Interrupt</description>
            <value>25</value>
        </interrupt>
        <interrupt>
            <name>T32_INT2_IRQ</name>
            <description>T32_INT2 Interrupt</description>
            <value>26</value>
        </interrupt>
        <interrupt>
            <name>T32_INTC_IRQ</name>
            <description>T32_INTC Interrupt</description>
            <value>27</value>
        </interrupt>
        <addressBlock>
            <offset>0x0</offset>
            <size>0xF0C</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>T32LOAD1</name>
                  <displayName>LOAD1</displayName>
                  <description>Timer 1 Load Register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>LOAD</name>
                        <description>The value from which the Timer 1 counter decrements</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>T32VALUE1</name>
                  <displayName>VALUE1</displayName>
                  <description>Timer 1 Current Value Register</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>VALUE</name>
                        <description>Current value</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>T32CONTROL1</name>
                  <displayName>CONTROL1</displayName>
                  <description>Timer 1 Timer Control Register</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000020</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>ONESHOT</name>
                        <description>Selects one-shot or wrapping counter mode</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ONESHOT_0</name>
                                <description>wrapping mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ONESHOT_1</name>
                                <description>one-shot mode</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SIZE</name>
                        <description>Selects 16 or 32 bit counter operation</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SIZE_0</name>
                                <description>16-bit counter</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SIZE_1</name>
                                <description>32-bit counter</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PRESCALE</name>
                        <description>Prescale bits</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>PRESCALE_0</name>
                                <description>0 stages of prescale, clock is divided by 1</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PRESCALE_1</name>
                                <description>4 stages of prescale, clock is divided by 16</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PRESCALE_2</name>
                                <description>8 stages of prescale, clock is divided by 256</description>
                                <value>2</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Interrupt enable bit</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>IE_0</name>
                                <description>Timer interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>IE_1</name>
                                <description>Timer interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MODE</name>
                        <description>Mode bit</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>MODE_0</name>
                                <description>Timer is in free-running mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>MODE_1</name>
                                <description>Timer is in periodic mode</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>Enable bit</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ENABLE_0</name>
                                <description>Timer disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLE_1</name>
                                <description>Timer enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>T32INTCLR1</name>
                  <displayName>INTCLR1</displayName>
                  <description>Timer 1 Interrupt Clear Register</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>INTCLR</name>
                        <description>Write clears interrupt output</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>T32RIS1</name>
                  <displayName>RIS1</displayName>
                  <description>Timer 1 Raw Interrupt Status Register</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>RAW_IFG</name>
                        <description>Raw interrupt status</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>T32MIS1</name>
                  <displayName>MIS1</displayName>
                  <description>Timer 1 Interrupt Status Register</description>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>IFG</name>
                        <description>Enabled interrupt status</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>T32BGLOAD1</name>
                  <displayName>BGLOAD1</displayName>
                  <description>Timer 1 Background Load Register</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>BGLOAD</name>
                        <description>Value from which the counter decrements</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>T32LOAD2</name>
                  <displayName>LOAD2</displayName>
                  <description>Timer 2 Load Register</description>
                  <addressOffset>0x20</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>LOAD</name>
                        <description>The value from which the Timer 2 counter decrements</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>T32VALUE2</name>
                  <displayName>VALUE2</displayName>
                  <description>Timer 2 Current Value Register</description>
                  <addressOffset>0x24</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>VALUE</name>
                        <description>Current value of the decrementing counter</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>T32CONTROL2</name>
                  <displayName>CONTROL2</displayName>
                  <description>Timer 2 Timer Control Register</description>
                  <addressOffset>0x28</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000020</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>ONESHOT</name>
                        <description>Selects one-shot or wrapping counter mode</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ONESHOT_0</name>
                                <description>wrapping mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ONESHOT_1</name>
                                <description>one-shot mode</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SIZE</name>
                        <description>Selects 16 or 32 bit counter operation</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SIZE_0</name>
                                <description>16-bit counter</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SIZE_1</name>
                                <description>32-bit counter</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PRESCALE</name>
                        <description>Prescale bits</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>PRESCALE_0</name>
                                <description>0 stages of prescale, clock is divided by 1</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PRESCALE_1</name>
                                <description>4 stages of prescale, clock is divided by 16</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PRESCALE_2</name>
                                <description>8 stages of prescale, clock is divided by 256</description>
                                <value>2</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Interrupt enable bit</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>IE_0</name>
                                <description>Timer interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>IE_1</name>
                                <description>Timer interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MODE</name>
                        <description>Mode bit</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>MODE_0</name>
                                <description>Timer is in free-running mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>MODE_1</name>
                                <description>Timer is in periodic mode</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>Enable bit</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ENABLE_0</name>
                                <description>Timer disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLE_1</name>
                                <description>Timer enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>T32INTCLR2</name>
                  <displayName>INTCLR2</displayName>
                  <description>Timer 2 Interrupt Clear Register</description>
                  <addressOffset>0x2C</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>INTCLR</name>
                        <description>Write clears the interrupt output</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>T32RIS2</name>
                  <displayName>RIS2</displayName>
                  <description>Timer 2 Raw Interrupt Status Register</description>
                  <addressOffset>0x30</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>RAW_IFG</name>
                        <description>Raw interrupt status</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>T32MIS2</name>
                  <displayName>MIS2</displayName>
                  <description>Timer 2 Interrupt Status Register</description>
                  <addressOffset>0x34</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>IFG</name>
                        <description>Enabled interrupt status</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
