cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401R.svd
            <register>
                  <name>DMA_STAT</name>
                  <displayName>STAT</displayName>
                  <description>Status Register</description>
                  <addressOffset>0x1000</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0f00ffff</resetMask>
                  <fields>
                    <field>
                        <name>MASTEN</name>
                        <description>Enable status of the controller</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>MASTEN_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>MASTEN_0</name>
                                <description>Controller disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>MASTEN_1</name>
                                <description>Controller enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>STATE</name>
                        <description>Current state of the control state machine.
State can be one of the following:</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>STATE_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>STATE_0</name>
                                <description>idle</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>STATE_1</name>
                                <description>reading channel controller data</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>STATE_2</name>
                                <description>reading source data end pointer</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>STATE_3</name>
                                <description>reading destination data end pointer</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>STATE_4</name>
                                <description>reading source data</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>STATE_5</name>
                                <description>writing destination data</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>STATE_6</name>
                                <description>waiting for DMA request to clear</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>STATE_7</name>
                                <description>writing channel controller data</description>
                                <value>7</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>STATE_8</name>
                                <description>stalled</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>STATE_9</name>
                                <description>done</description>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>STATE_10</name>
                                <description>peripheral scatter-gather transition</description>
                                <value>10</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DMACHANS</name>
                        <description>Number of available DMA channels minus one.</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>DMACHANS_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>DMACHANS_0</name>
                                <description>Controller configured to use 1 DMA channel</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DMACHANS_1</name>
                                <description>Controller configured to use 2 DMA channels</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DMACHANS_30</name>
                                <description>Controller configured to use 31 DMA channels</description>
                                <value>30</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DMACHANS_31</name>
                                <description>Controller configured to use 32 DMA channels</description>
                                <value>31</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TESTSTAT</name>
                        <description>To reduce the gate count the controller can be configured to exclude the integration test logic.
The values 2h to Fh are Reserved.</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>TESTSTAT_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>TESTSTAT_0</name>
                                <description>Controller does not include the integration test logic</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TESTSTAT_1</name>
                                <description>Controller includes the integration test logic</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_CFG</name>
                  <displayName>CFG</displayName>
                  <description>Configuration Register</description>
                  <addressOffset>0x1004</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>MASTEN</name>
                        <description>Enable status of the controller</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>MASTEN_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>MASTEN_0</name>
                                <description>Controller disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>MASTEN_1</name>
                                <description>Controller enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CHPROTCTRL</name>
                        <description>Sets the AHB-Lite protection by controlling the HPROT[3:1] signal
