cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401R.svd
dma_sreq from generating requests.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLR_1</name>
                                <description>Enables dma_req[C] or dma_sreq[C] to generate DMA requests.
Writing to a bit where a DMA channel is not implemented has no effect.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_ENASET</name>
                  <displayName>ENASET</displayName>
                  <description>Channel Enable Set Register</description>
                  <addressOffset>0x1028</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>SET</name>
                        <description>Returns the enable status of the channels, or enables the
corresponding channels.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <name>SET_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>SET_0_READ</name>
                                <description>Channel C is disabled.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SET_1_READ</name>
                                <description>Channel C is enabled.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                        <enumeratedValues>
                            <name>SET_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>SET_0_WRITE</name>
                                <description>No effect.
Use the DMA_ENACLR Register to disable a channel.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SET_1_WRITE</name>
                                <description>Enables channel C.
Writing to a bit where a DMA channel is not implemented has no effect.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_ENACLR</name>
                  <displayName>ENACLR</displayName>
                  <description>Channel Enable Clear Register</description>
                  <addressOffset>0x102C</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>CLR</name>
                        <description>Set the appropriate bit to disable the corresponding DMA channel.
Note: The controller disables a channel, by setting the appropriate
bit, when:
a) it completes the DMA cycle
b) it reads a channel_cfg memory location which has cycle_ctrl =
b000
c) an ERROR occurs on the AHB-Lite bus.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLR_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLR_0</name>
                                <description>No effect.
Use the DMA_ENASET Register to enable DMA channels.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLR_1</name>
                                <description>Disables channel C.
Writing to a bit where a DMA channel is not implemented has no effect.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_ALTSET</name>
                  <displayName>ALTSET</displayName>
                  <description>Channel Primary-Alternate Set Register</description>
                  <addressOffset>0x1030</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>SET</name>
                        <description>Channel Primary-Alternate Set Register</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <name>SET_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>SET_0_READ</name>
                                <description>DMA channel C is using the primary data structure.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SET_1_READ</name>
                                <description>DMA channel C is using the alternate data structure.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                        <enumeratedValues>
                            <name>SET_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>SEL_0_WRITE</name>
                                <description>No effect.
Use the DMA_ALTCLR Register to set bit [C] to 0.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SEL_1_WRITE</name>
                                <description>Selects the alternate data structure for channel C.
