cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401R.svd
            <register>
                  <name>ADC14IFGR0</name>
                  <displayName>IFGR0</displayName>
                  <description>Interrupt Flag 0 Register</description>
                  <addressOffset>0x144</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>ADC14IFG0</name>
                        <description>ADC14MEM0 interrupt flag</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG0_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG0_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG0_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG1</name>
                        <description>ADC14MEM1 interrupt flag</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG1_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG1_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG1_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG2</name>
                        <description>ADC14MEM2 interrupt flag</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG2_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG2_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG2_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG3</name>
                        <description>ADC14MEM3 interrupt flag</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG3_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG3_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG3_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG4</name>
                        <description>ADC14MEM4 interrupt flag</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG4_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG4_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG4_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG5</name>
                        <description>ADC14MEM5 interrupt flag</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG5_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG5_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG5_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG6</name>
                        <description>ADC14MEM6 interrupt flag</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG6_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG6_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG6_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG7</name>
                        <description>ADC14MEM7 interrupt flag</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG7_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG7_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG7_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG8</name>
                        <description>ADC14MEM8 interrupt flag</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG8_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG8_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG8_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG9</name>
                        <description>ADC14MEM9 interrupt flag</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG9_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG9_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG9_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG10</name>
                        <description>ADC14MEM10 interrupt flag</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG10_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG10_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG10_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG11</name>
                        <description>ADC14MEM11 interrupt flag</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG11_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG11_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG11_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG12</name>
                        <description>ADC14MEM12 interrupt flag</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG12_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG12_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG12_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG13</name>
                        <description>ADC14MEM13 interrupt flag</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG13_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG13_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG13_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG14</name>
                        <description>ADC14MEM14 interrupt flag</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG14_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG14_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG14_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG15</name>
                        <description>ADC14MEM15 interrupt flag</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG15_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG15_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG15_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG16</name>
                        <description>ADC14MEM16 interrupt flag</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG16_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG16_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG16_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG17</name>
                        <description>ADC14MEM17 interrupt flag</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG17_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG17_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG17_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG18</name>
                        <description>ADC14MEM18 interrupt flag</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG18_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG18_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG18_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG19</name>
                        <description>ADC14MEM19 interrupt flag</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG19_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG19_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG19_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG20</name>
                        <description>ADC14MEM20 interrupt flag</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG20_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG20_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG20_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG21</name>
                        <description>ADC14MEM21 interrupt flag</description>
                        <bitOffset>0x15</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
